<?php

function kaz_translit($str, $flip = false)
{
    $array = array(
        "ә" => "&#1241;",
        "ң" => "&#1187;",
        "ғ" => "&#1171;",
        "ү" => "&#1199;",
        "ұ" => "&#1201;",
        "қ" => "&#1179;",
        "ө" => "&#1257;",
        "һ" => "&#1211;",
        "Ә" => "&#1240;",
        "Ң" => "&#1186;",
        "Ғ" => "&#1170;",
        "Ү" => "&#1198;",
        "Ұ" => "&#1200;",
        "Қ" => "&#1178;",
        "Ө" => "&#1256;",
        "Һ" => "&#1210;"
    );
    if ($flip)
        $array = array_flip($array);
    $translit = strtr($str, $array);

    return $translit;
}
